{
  "folklore": [
    {
      "name": "Irish Fairies",
      "translation": "Aos sí",
      "description": [
        "In many Gaelic tales, the aos sí are later literary versions of the Tuatha Dé Danann ('People of the Goddess Danu')—the deities and deified ancestors of Irish mythology.",
        "Some sources describe them as the survivors of the Tuatha Dé Danann who retreated into the Otherworld when fleeing the mortal Sons of Míl Espáine.",
        "As part of the terms of their surrender to the Milesians, the Tuatha Dé Danann agreed to retreat and dwell underground.",
        "In later interpretations, each tribe of the Tuatha Dé Danann was given its own mound."
      ],
      "image": "../src/images/Irish_Faeries.png",
      "appearance": [
        "The aos sí are generally described as stunningly beautiful, though they can also be terrible and hideous."
      ],
      "behaviour": {
        "beliefs": [
          "Aos sí are often appeased with offerings.",
          "Care is taken to avoid angering or insulting them.",
          "They are often referred to indirectly."
        ],
        "punishments": [
          "Kidnapping trespassers",
          "Replacing children with changelings"
        ]
      },
      "connections": {
        "festivals": ["Samhain", "Bealtaine", "Midsummer"],
        "time_associations": ["Dusk", "Dawn"],
        "beliefs": "The Gaelic Otherworld is believed to come closer to the mortal world at the times of dusk and dawn, making the aos sí easier to encounter."
      }
    },
    {
      "name": "Banshee",
      "translation": "/ˈbænʃiː/ BAN-shee",
      "description": [
        "A banshee is a female spirit in Irish folklore who heralds the death of a family member, usually by screaming, wailing, shrieking, or keening.",
        "Her name is linked to the mythologically important tumuli or 'mounds' (sídhe) found across the Irish countryside."
      ],
      "image": "../src/images/Banshee.png",
      "appearance": [
        "Banshees are often depicted as pale women with long hair, wearing a grey or white gown."
      ],
      "behaviour": {
        "beliefs": [
          "Banshees are often seen as omens of death.",
          "They may appear to families in different forms."
        ],
        "punishments": ["They may curse those who disrespect the family."]
      },
      "connections": {
        "festivals": ["All Hallows' Eve"],
        "time_associations": ["Night"],
        "beliefs": "The appearance of a banshee is believed to precede a death in the family."
      }
    },
    {
      "name": "Dullahan",
      "translation": "Dullahan",
      "description": [
        "The Dullahan is a headless horseman, depicted in Irish folklore as a terrifying figure, often riding a black horse, carrying his own head.",
        "The Dullahan's severed head has a grotesque appearance, with pale, parchment-like skin stretched over the surface, and eyes that move erratically like meteors."
      ],
      "image": "../src/images/Dullahan.png",
      "appearance": [
        "The Dullahan's severed head is often described as having pale skin with a macabre, terrifying expression."
      ],
      "behaviour": {
        "beliefs": [
          "The Dullahan is said to be a harbinger of death, collecting the souls of the deceased."
        ],
        "punishments": [
          "Those who see the Dullahan are said to die soon after."
        ]
      },
      "connections": {
        "festivals": ["Samhain"],
        "time_associations": ["Midnight"],
        "beliefs": "The Dullahan's appearance is linked to the end of life and is feared by those who encounter him."
      }
    }
  ]
}
